Функциональность: Открытие основных форм справочников

Контекст:
	Дано я подключаю профиль TestClient "Полный доступ"	
	
Сценарий: Открытие формы объекта "Банки"

	Дано Я открываю основную форму справочника "Банки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Банки"
	И я закрываю текущее окно

Сценарий: Открытие формы списка "БанковскиеСчета" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчета"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалоговИПлатежейВБюджет"

	Дано Я открываю основную форму справочника "ВидыНалоговИПлатежейВБюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговИПлатежейВБюджет"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ГосКонтракты"

	Дано Я открываю основную форму справочника "ГосКонтракты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГосКонтракты"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентов"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И я закрываю текущее окно

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Номенклатура"

	Дано Я открываю основную форму справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И я закрываю текущее окно

	Дано Я открываю основную форму списка справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Организации"

	Дано Я открываю основную форму справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И я закрываю текущее окно

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодразделенияОрганизации"

	Дано Я открываю основную форму справочника "ПодразделенияОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодразделенияОрганизаций"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиДвиженияДенежныхСредств"

	Дано Я открываю основную форму справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "НематериальныеАктивы"

	Дано Я открываю основную форму справочника "НематериальныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НематериальныеАктивы"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъектыСтроительства"

	Дано Я открываю основную форму справочника "ОбъектыСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбъектыСтроительства"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсновныеСредства"

	Дано Я открываю основную форму справочника "ОсновныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсновныеСредства"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыБудущихПериодов"

	Дано Я открываю основную форму справочника "РасходыБудущихПериодов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РасходыБудущихПериодов"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦенныеБумаги"

	Дано Я открываю основную форму справочника "ЦенныеБумаги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦенныеБумаги"
	И я закрываю текущее окно

	Дано Я открываю основную форму списка справочника "ЦенныеБумаги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦенныеБумаги"
	И я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеШаблонов"

	Дано Я открываю основную форму справочника "ХранилищеШаблонов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранилищеШаблонов"
	И я закрываю текущее окно